# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [566]:
import pandas as pd

In [643]:
url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv"
df = pd.read_csv(url)

df.columns = [column.lower().replace(" ","-").replace("ST","state") for column in df.columns]

df

,customer,st,gender,education,customer-lifetime-value,income,monthly-premium-auto,number-of-open-complaints,policy-type,vehicle-class,total-claim-amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [647]:
df.dtypes

customer                      object
st                            object
gender                        object
education                     object
customer-lifetime-value       object
income                       float64
monthly-premium-auto         float64
number-of-open-complaints     object
policy-type                   object
vehicle-class                 object
total-claim-amount           float64
dtype: object

In [649]:
df.isnull().sum()

customer                     2937
st                           2937
gender                       3054
education                    2937
customer-lifetime-value      2940
income                       2937
monthly-premium-auto         2937
number-of-open-complaints    2937
policy-type                  2937
vehicle-class                2937
total-claim-amount           2937
dtype: int64

In [651]:
df["gender"].isnull().sum()

3054

In [653]:
df["gender"].value_counts()

gender
F         457
M         413
Male       39
female     28
Femal      17
Name: count, dtype: int64

In [655]:
df["gender"].unique()

array([nan, 'F', 'M', 'Femal', 'Male', 'female'], dtype=object)

In [657]:
def gender_category(value):
    if value == "Male":
        return "M"
    elif value == "female":
        return "F"
    elif value == "Femal":
        return "F"
    else:
        return value
    

df["gender"] = df["gender"].apply(gender_category)

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [663]:
df["customer-lifetime-value"]

0               NaN
1        697953.59%
2       1288743.17%
3        764586.18%
4        536307.65%
           ...
4003            NaN
4004            NaN
4005            NaN
4006            NaN
4007            NaN
Name: customer-lifetime-value, Length: 4008, dtype: object

In [665]:
# Customer lifetime value should be numeric

def remove_percentage_char(value):
    if type(value) == str:
        return float(value.strip("%"))
    else:
        return value
    
df["customer-lifetime-value"] = df["customer-lifetime-value"].apply(remove_percentage_char)

In [667]:
df.head()

,customer,st,gender,education,customer-lifetime-value,income,monthly-premium-auto,number-of-open-complaints,policy-type,vehicle-class,total-claim-amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [594]:
# Number of open complaints has an incorrect format. Look at the different values
# it takes with unique() and take the middle value. As an example, 1/5/00 should be 5. 
# Number of open complaints is a string - remember you can use split() to deal with 
# it and take the number you need. Finally, since it should be numeric, cast the column
# to be in its proper type.

def clean_number_of_complains(value):
    if type(value) == str:
        return int(value.split("/")[1])
    else:
        return value

# df["number-of-open-complaints"].apply(clean_number_of_complains).unique()

df["number-of-open-complaints"] = df["number-of-open-complaints"].apply(clean_number_of_complains)

In [596]:
df.head()

,customer,st,gender,education,customer-lifetime-value,income,monthly-premium-auto,number-of-open-complaints,policy-type,vehicle-class,total-claim-amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,0.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,0.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,0.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,0.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,0.0,Personal Auto,Four-Door Car,17.269323

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers.

In [600]:
df.isnull().sum()

customer                     2937
st                           2937
gender                       3054
education                    2937
customer-lifetime-value      2940
income                       2937
monthly-premium-auto         2937
number-of-open-complaints    2937
policy-type                  2937
vehicle-class                2937
total-claim-amount           2937
dtype: int64

In [602]:
# Drop the rows or columns with null values

df = df.dropna(axis=0, how="all")
df.head()

,customer,st,gender,education,customer-lifetime-value,income,monthly-premium-auto,number-of-open-complaints,policy-type,vehicle-class,total-claim-amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,0.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,0.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,0.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,0.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,0.0,Personal Auto,Four-Door Car,17.269323

In [604]:
df.isnull().sum() #checking for null values in cleaned dataframe

customer                       0
st                             0
gender                       117
education                      0
customer-lifetime-value        3
income                         0
monthly-premium-auto           0
number-of-open-complaints      0
policy-type                    0
vehicle-class                  0
total-claim-amount             0
dtype: int64

In [606]:
df["gender"].mode()

0    F
Name: gender, dtype: object

In [608]:
df["gender"].value_counts() # mode is the most repeated value ---> 'F'

gender
F         457
M         413
Male       39
female     28
Femal      17
Name: count, dtype: int64

In [671]:
df["gender"] = df["gender"].fillna("F") #filling null values in gender with 'F'
df.head()

,customer,st,gender,education,customer-lifetime-value,income,monthly-premium-auto,number-of-open-complaints,policy-type,vehicle-class,total-claim-amount
0,RB50392,Washington,F,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [612]:
df["customer-lifetime-value"].mean()

793690.2593445693

In [614]:
df["customer-lifetime-value"].median()

588174.235

In [616]:
df["customer-lifetime-value"].describe() # the max value seems to be an outlier so lets fill the null values with the median

count    1.068000e+03
mean     7.936903e+05
std      6.434784e+05
min      2.004351e+05
25%      4.034080e+05
50%      5.881742e+05
75%      8.962872e+05
max      5.816655e+06
Name: customer-lifetime-value, dtype: float64

In [618]:
df["customer-lifetime-value"] = df["customer-lifetime-value"].fillna(df["customer-lifetime-value"].median())

df.head()

/var/folders/yz/shh48k7s5kg3qtp0x9hzjb6c0000gn/T/ipykernel_94324/2839746673.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["customer-lifetime-value"] = df["customer-lifetime-value"].fillna(df["customer-lifetime-value"].median())

,customer,st,gender,education,customer-lifetime-value,income,monthly-premium-auto,number-of-open-complaints,policy-type,vehicle-class,total-claim-amount
0,RB50392,Washington,F,Master,588174.235,0.0,1000.0,0.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.590,0.0,94.0,0.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.170,48767.0,108.0,0.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.180,0.0,106.0,0.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.650,36357.0,68.0,0.0,Personal Auto,Four-Door Car,17.269323

In [620]:
# Verify that your strategy has successfully handled the null values.

df.isnull().sum()

customer                     0
st                           0
gender                       0
education                    0
customer-lifetime-value      0
income                       0
monthly-premium-auto         0
number-of-open-complaints    0
policy-type                  0
vehicle-class                0
total-claim-amount           0
dtype: int64

In [622]:
# Convert all the numeric variables to integers

# df["customer-lifetime-value"] = df["customer-lifetime-value"].astype(int)
# df["income"] = df["income"].astype(int)
# df["monthly-premium-auto"] = df["monthly-premium-auto"].astype(int)
# ...

# converting all at the same time

df = df.select_dtypes(include=["number"]).astype("int") # voilÃ 

df.head()

,customer-lifetime-value,income,monthly-premium-auto,number-of-open-complaints,total-claim-amount
0,588174,0,1000,0,2
1,697953,0,94,0,1131
2,1288743,48767,108,0,566
3,764586,0,106,0,529
4,536307,36357,68,0,17

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [548]:
df.duplicated().sum()

41

In [628]:
df_duplicates = df.copy()

df_duplicates.drop_duplicates(keep = "first") # will drop only the rows that are duplicated and will keep the first occurence - no need to check for subsets

df_duplicates.duplicated().sum() # no more duplicates

41

In [636]:
df_duplicates.head()

,customer-lifetime-value,income,monthly-premium-auto,number-of-open-complaints,total-claim-amount
0,588174,0,1000,0,2
1,697953,0,94,0,1131
2,1288743,48767,108,0,566
3,764586,0,106,0,529
4,536307,36357,68,0,17

In [638]:
# Save the cleaned dataset to a new CSV file.

df_duplicates.to_csv("df_duplicates_lab.csv")

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [673]:
%%writefile data_cleaning/__init__.py

Writing data_cleaning/__init__.py

In [675]:
%%writefile data_cleaning/clean_column_names.py
# clean column names
import pandas as pd

df.columns = [column.lower().replace(" ","-").replace("ST","state") for column in df.columns]

Writing data_cleaning/__clean_column_names__.py

In [677]:
%%writefile data_cleaning/clean_gender_column.py
#clean gender column
def clean_gender_column(df):
    def gender_category(value):
        if value == "Male":
            return "M"
        elif value == "female":
            return "F"
        elif value == "Femal":
            return "F"
        else:
            return value

    df["gender"] = df["gender"].apply(gender_category)
    return df

Writing data_cleaning/clean_gender_column.py

In [679]:
%%writefile data_cleaning/clv_to_intr.py
# covert CLV to integer
def clv_to_intr(df):
    def remove_percentage_char(value):
        if type(value) == str:
            return float(value.strip("%"))
        else:
            return value
    df["customer-lifetime-value"] = df["customer-lifetime-value"].apply(remove_percentage_char)
    return df

Writing data_cleaning/clv_to_intr.py

In [681]:
%%writefile data_cleaning/clean_number_of_complains.py
# convert number of complaints into inter
def clean_number_of_complains(value):
    if type(value) == str:
        return int(value.split("/")[1])
    else:
        return value

df["number-of-open-complaints"] = df["number-of-open-complaints"].apply(clean_number_of_complains)

Writing data_cleaning/clean_number_of_complains.py

In [683]:
%%writefile data_cleaning/drop_full_null_columns.py
# drop the rows or columns with null values
df = df.dropna(axis=0, how="all")

Writing data_cleaning/drop_full_null_columns.py

In [685]:
%%writefile data_cleaning/null_gender_to_mode.py
# fill null vales in gender with mode
df["gender"] = df["gender"].fillna(df["gender"].mode()[0])

Writing data_cleaning/null_gender_to_mode.py

In [687]:
%%writefile data_cleaning/null_cv_to_median.py
# fill null values in CLV with median
df["customer-lifetime-value"] = df["customer-lifetime-value"].fillna(df["customer-lifetime-value"].median())

Writing data_cleaning/null_cv_to_median.py

In [689]:
%%writefile data_cleaning/convert_full_df_to_int.py
# convert all values to int
df = df.select_dtypes(include=["number"]).astype("int")

Writing data_cleaning/convert_full_df_to_int.py

In [691]:
%%writefile data_cleaning/remove_duplicates.py
# remove duplicates & save them in a new file
df_duplicates = df.copy()

df_duplicates.drop_duplicates(keep = "first")

df_duplicates.to_csv("./data/df_duplicates_lab.csv")

Writing data_cleaning/remove_duplicates.py

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [699]:
df[["customer-lifetime-value", "total-claim-amount"]].describe()

       customer-lifetime-value  total-claim-amount
count             1.068000e+03         1071.000000
mean              7.936903e+05          404.986909
std               6.434784e+05          293.027260
min               2.004351e+05            0.382107
25%               4.034080e+05          202.157702
50%               5.881742e+05          354.729129
75%               8.962872e+05          532.800000
max               5.816655e+06         2893.239678